routes_and_controllers/app/models/artwork.rb

    def self.artworks_for_user_id(user_id)
        #return array of hashes with all artworks associated with user_id
        #artworks that belong to artist
        #artworks that are shared with artist/user
        user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]