routes_and_controllers/app/models/comment.rb

  def self.comments_for_artwork_id(artwork_id)
        artwork = Artwork.find(artwork_id)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]