routes_and_controllers/app/controllers/artworks_controller.rb

    def update
        artwork = Artwork.find_by(id: params[:id])

        if artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "A View of Mt Fuji"], ["updated_at", "2022-11-10 21:56:39.121984"], ["id", 7]]