routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Nathan"], ["email", "Nathan@nathan.com"], ["updated_at", "2022-11-10 18:16:21.154444"], ["id", 5]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)